        Data Science: A Programming Approach
        Mahyar S Vaghefi
        University of Texas Arlington
        
        This document can only be used for class studies. 
        You are not allowed to share it in any public platform.

<h1 align='center' style="color: blue;">Introduction to Pandas</h1>

<p>Pandas is a package built on top of NumPy, and provides an efficient implementation of a DataFrame. DataFrames are essentially multidimensional arrays with attached row and column labels, and often with <b>heterogeneous</b> data types and/or missing data.

In [1]:
import pandas as pd

<p>Pandas has two main types of data structure:</p>
<ul>
    <li>Series: 1-dimensional labeled array.</li>
    <li>DataFrames:  2D labeled table structure with columns of potentially different types.</li>
<ul>

## 1. Series

A Series can be thought of as a one-dimensional array that has labels. You can think of it like a dictionary where the keys are the labels (index) and the values are the data.

In [33]:
exp1_series = pd.Series([0.25, 0.5, 0.75, 1.0])
exp1_series

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

The series has an array of values and an associated array of data labels, called its index.

In [34]:
print("Values:", exp1_series.values)
print("Index:", exp1_series.index)

Values: [0.25 0.5  0.75 1.  ]
Index: RangeIndex(start=0, stop=4, step=1)

<b>Note:</b> You can define index separately. By default, the index is just a list of integers, but it can be of any desired type.

In [35]:
exp2_series = pd.Series(data=[1,'a', 2, 'b', 3], index=['c1','c2','c3','c4','c5'])
print(exp2_series)

c1    1
c2    a
c3    2
c4    b
c5    3
dtype: object

<p><b>Note:</b> Series can be constructed from dictionaries as well. The keys become the index.</p>

In [36]:
a_dict = {'a1':1,'a2':2, 'a3':3, 'a4':4, 'a5':5}
exp3_series = pd.Series(a_dict)
print(exp3_series)

a1    1
a2    2
a3    3
a4    4
a5    5
dtype: int64

<p><b>Note:</b> Values in a series can be accessed using their index labels or integer locations.</p>

In [37]:
# Using index
print(exp3_series['a2'])

# Using integer location
print(exp3_series[1])

2
2

Here how you can accessing multiple values:

In [38]:
print(exp3_series[[0,2]])
print()
# Or
print(exp3_series.iloc[[0,2]])         #iloc implicit referencing
print()
# Or
print(exp3_series[['a1','a3']])
print()
# Or
print(exp3_series.loc[['a1','a3']])    #loc explicit referencing

a1    1
a3    3
dtype: int64

a1    1
a3    3
dtype: int64

a1    1
a3    3
dtype: int64

a1    1
a3    3
dtype: int64

<p><b>Note:</b> 
    
When dealing with numeric indices, it's essential to be clear about whether you're referring to the label (`.loc[]`) or the position (`.iloc[]`). This can prevent unexpected errors.</p>

In [39]:
exp4_series = pd.Series(data=[1,'a', 2, 'b', 3], index=[4,5,6,7,8])
exp4_series.iloc[4]   # You will get an error message

3

In [40]:
exp4_series.iloc[4]  #implicit

3

In [41]:
exp4_series.loc[4]  #explicit

1

<p><b>Note:</b> Arithmetic operations and other functions can be applied to Series, similar to Numpy arrays..</p>

In [42]:
exp5_series = pd.Series([1,'abc',2,'def',3])
print(exp5_series * 2)

0         2
1    abcabc
2         4
3    defdef
4         6
dtype: object

## 2. DataFrame

<p>The DataFrame is a generalization of arrays in NumPy. DataFrame is an analog of a two-dimensional array with both flexible <b>row indices</b> and flexible <b>column names</b>.</p>

<p>There are three common methods to form DataFrames:</p>
<ol>
    <li>Dictionary of Pandas Series</li>
    <li>List of Dictionaries</li>
    <li>Two-dimensional NumPy array</li>  
</ol>

Creating a DataFrame using a Dictionary of Pandas Series:

In [43]:
population_dict = {'California': 38332521,
                    'Texas': 26448193,
                    'New York': 19651127,
                    'Florida': 19552860,
                    'Illinois': 12882135}
pupulation = pd.Series(population_dict)

area_dict = {'California': 423967,
             'Texas': 695662,
             'New York': 141297,
             'Florida': 170312,
             'Illinois': 149995}
area = pd.Series(area_dict)

state_data = pd.DataFrame({'Population':pupulation, 'Area':area})
state_data

            Population    Area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [44]:
print(state_data)

            Population    Area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

You can combine the last two steps and do it in one step.

In [45]:
state_data = pd.DataFrame({'Population': pd.Series({'California': 38332521,
                                                    'Texas': 26448193,
                                                    'New York': 19651127,
                                                    'Florida': 19552860,
                                                    'Illinois': 12882135}), 
                           'Area':pd.Series({'California': 423967,
                                             'Texas': 695662,
                                             'New York': 141297,
                                             'Florida': 170312, 
                                             'Illinois': 149995})
                          })
state_data

            Population    Area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

<p><b>Note:</b> If you do not want to define row names, then you can use a dictionary of lists to create the data farme.</p>

In [46]:
state_data_without_rownames = pd.DataFrame({'Population': 
                                            [38332521, 26448193, 19651127, 19552860, 12882135], 
                                            'Area':
                                            [423967, 695662, 141297, 170312, 149995]})
state_data_without_rownames

   Population    Area
0    38332521  423967
1    26448193  695662
2    19651127  141297
3    19552860  170312
4    12882135  149995

<p><b>Example:</b> Create a new DataFrame with row names that includes "Population", "Area", and "Capital" information for California, Texas, New York, Florida, and Illinois. </p>

In [47]:
# Write your code here

<p><b>Note:</b> To form a DataFrame, you can use Series with different indicies and even in different orders. Pandas matches indicies from different Series. If it cannot find an index inside one provided Series then it fills the associated value for that column and index inside the DataFrame with <b style="color:blue;">NaN</b>. </p>

In [48]:
state_data = pd.DataFrame({'Population': pd.Series({'Texas': 26448193,
                                                    'Illinois': 12882135,
                                                    'Wisconsin':5840615,
                                                    'Florida': 19552860,
                                                    'California': 38332521, 
                                                    'New York': 19651127 }), 
                           'Area':pd.Series({'California': 423967,
                                             'Texas': 695662,
                                             'New York': 141297,
                                             'Florida': 170312, 
                                             'Illinois': 149995, 
                                             'Arizona': 113998})
                          })
state_data

            Population      Area
Arizona            NaN  113998.0
California  38332521.0  423967.0
Florida     19552860.0  170312.0
Illinois    12882135.0  149995.0
New York    19651127.0  141297.0
Texas       26448193.0  695662.0
Wisconsin    5840615.0       NaN

Using List of Dictionaries:

Here, each dictionary forms a row, with keys defining the columns.

In [49]:
a_list = [{'a':10,'b':15},{'b':18,'c':11,'d':5}]
a_DataFrame = pd.DataFrame(a_list)
a_DataFrame

      a   b     c    d
0  10.0  15   NaN  NaN
1   NaN  18  11.0  5.0

In [50]:
# Method3: Two-dimensional Numpy array
import numpy as np
np.random.seed(0)
an_array = np.random.randn(3,4)
a_DataFrame = pd.DataFrame(an_array, 
                           index = ['row1','row2','row3'], 
                           columns = ['col1','col2','col3','col4'])
a_DataFrame

          col1      col2      col3      col4
row1  1.764052  0.400157  0.978738  2.240893
row2  1.867558 -0.977278  0.950088 -0.151357
row3 -0.103219  0.410599  0.144044  1.454274

<p><b>Note:</b> You can use <b style="color:blue;">index</b> and <b style="color:blue;">columns</b> properties to access to row indices and column names. Keep in mind that these properites return <b>immutable</b> objects.</p>

In [51]:
state_data.index

Index(['Arizona', 'California', 'Florida', 'Illinois', 'New York', 'Texas',
       'Wisconsin'],
      dtype='object')

In [52]:
state_data.columns

Index(['Population', 'Area'], dtype='object')

<p><b>Note:</b> You can use <b style="color:blue;">shape</b> property to view the shape of a DataFrame.</p>

In [53]:
state_data.shape

(7, 2)

<p><b>Note:</b> The individual Series that make up the columns can be accessed in following styles:</p>

* dictionary-style indexing

In [54]:
state_data

            Population      Area
Arizona            NaN  113998.0
California  38332521.0  423967.0
Florida     19552860.0  170312.0
Illinois    12882135.0  149995.0
New York    19651127.0  141297.0
Texas       26448193.0  695662.0
Wisconsin    5840615.0       NaN

In [55]:
state_data['Area']  # the output is an individual Series

Arizona       113998.0
California    423967.0
Florida       170312.0
Illinois      149995.0
New York      141297.0
Texas         695662.0
Wisconsin          NaN
Name: Area, dtype: float64

* property style

In [56]:
state_data.Area  # the output is an individual Series

Arizona       113998.0
California    423967.0
Florida       170312.0
Illinois      149995.0
New York      141297.0
Texas         695662.0
Wisconsin          NaN
Name: Area, dtype: float64

<p><b>Note:</b> If you want to access to one column but still keep the DataFrame Structure you need to use the following format in your codde:</p>

In [57]:
state_data[['Area']]

                Area
Arizona     113998.0
California  423967.0
Florida     170312.0
Illinois    149995.0
New York    141297.0
Texas       695662.0
Wisconsin        NaN

<p><b>Note:</b> You can create a new column using existing columns in a DataFrame.</p>

In [58]:
state_data['Density'] = 0

In [63]:
state_data

            Population      Area     Density
Arizona            NaN  113998.0         NaN
California  38332521.0  423967.0   90.413926
Florida     19552860.0  170312.0  114.806121
Illinois    12882135.0  149995.0   85.883763
New York    19651127.0  141297.0  139.076746
Texas       26448193.0  695662.0   38.018740
Wisconsin    5840615.0       NaN         NaN

In [64]:
state_data['Density'] = state_data['Population']/state_data['Area']
state_data

            Population      Area     Density
Arizona            NaN  113998.0         NaN
California  38332521.0  423967.0   90.413926
Florida     19552860.0  170312.0  114.806121
Illinois    12882135.0  149995.0   85.883763
New York    19651127.0  141297.0  139.076746
Texas       26448193.0  695662.0   38.018740
Wisconsin    5840615.0       NaN         NaN

<p><b>Note:</b> You can use <b style="color:blue;">rename( )</b> function to rename column names and indices.</p>

In [65]:
state_data = state_data.rename(columns={'Population':'pop', 
                                        'Area':'area', 
                                        'Density':'den'}, 
                  index={'Arizona':'AZ',
                         'California':'CA',
                         'Florida':'FL',
                         'Illinois':'IL',
                         'New York':'NY',
                         'Texas':'TX',
                         'Wisconsin':'WI'}
                 )
state_data

           pop      area         den
AZ         NaN  113998.0         NaN
CA  38332521.0  423967.0   90.413926
FL  19552860.0  170312.0  114.806121
IL  12882135.0  149995.0   85.883763
NY  19651127.0  141297.0  139.076746
TX  26448193.0  695662.0   38.018740
WI   5840615.0       NaN         NaN

In [66]:
# second option

state_data.rename(columns={'Population':'pop', 
                                        'Area':'area', 
                                        'Density':'den'}, 
                  index={'Arizona':'AZ',
                         'California':'CA',
                         'Florida':'FL',
                         'Illinois':'IL',
                         'New York':'NY',
                         'Texas':'TX',
                         'Wisconsin':'WI'},
                  inplace=True
                 )

### 2.1. Indexing in DataFrames

<p><b>Note:</b> You can access to subset of a DataFrame in the following formats:</p>

In [67]:
pd.DataFrame(state_data, index = ['CA','TX','WI'])

           pop      area        den
CA  38332521.0  423967.0  90.413926
TX  26448193.0  695662.0  38.018740
WI   5840615.0       NaN        NaN

In [68]:
pd.DataFrame(state_data, index = ['CA','TX','WI'], columns=['area','den'])

        area        den
CA  423967.0  90.413926
TX  695662.0  38.018740
WI       NaN        NaN

In [69]:
state_data.iloc[:3, :2]

           pop      area
AZ         NaN  113998.0
CA  38332521.0  423967.0
FL  19552860.0  170312.0

In [70]:
state_data.loc[:'IL', :'area']

           pop      area
AZ         NaN  113998.0
CA  38332521.0  423967.0
FL  19552860.0  170312.0
IL  12882135.0  149995.0

In [71]:
state_data

           pop      area         den
AZ         NaN  113998.0         NaN
CA  38332521.0  423967.0   90.413926
FL  19552860.0  170312.0  114.806121
IL  12882135.0  149995.0   85.883763
NY  19651127.0  141297.0  139.076746
TX  26448193.0  695662.0   38.018740
WI   5840615.0       NaN         NaN

<p><b>Note:</b> You can also apply filtering to access a subset of data. Keep in mind that to apply filtering you need to use <u>loc</u> attribute.</p>

In [74]:
state_data.den>100

AZ    False
CA    False
FL     True
IL    False
NY     True
TX    False
WI    False
Name: den, dtype: bool

In [40]:
state_data.loc[state_data.den>100,['pop', 'area']]

           pop      area
FL  19552860.0  170312.0
NY  19651127.0  141297.0

### 2.2. Index Alignment in DataFrames

<p><b>Note:</b> Pandas aligns DataFrames based on their column names and row indices.</p>

In [41]:
np.random.seed(0)
first_array = np.random.randint(1,10,(3,3))
second_array = np.array([[1,2],
                        [3,4]])

df1 = pd.DataFrame(first_array, columns = ['A','B','C'] )
df2 = pd.DataFrame(second_array, columns = ['B','A'] )

print(df1)
print()
print(df2)

df1 + df2

   A  B  C
0  6  1  4
1  4  8  4
2  6  3  5

   B  A
0  1  2
1  3  4

     A     B   C
0  8.0   2.0 NaN
1  8.0  11.0 NaN
2  NaN   NaN NaN

### 2.3.Operations Between DataFrame and Series (Broadcasting)

In [75]:
a_Series = pd.Series([1,2,3,4],['a','b','c','d'])
a_dataframe = pd.DataFrame([[1,2,3,4],[5,6,7,8],[9,10,11,12]], columns = ['b','a','d','c'])

In [76]:
a_Series

a    1
b    2
c    3
d    4
dtype: int64

In [77]:
a_dataframe

   b   a   d   c
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [78]:
a_dataframe - a_Series

   a  b  c  d
0  1 -1  1 -1
1  5  3  5  3
2  9  7  9  7

<p><b>Example:</b> (1) Create a DataFrame with the shape of (5,8) and filled by random integers. (2) Subtract the first row of the DataFrame from all the rows in the DataFrame.</p>

In [ ]:
df - df.loc[0,:]

<p><b>Example:</b> (1) Create a DataFrame with the shape of (6,4) and filled by random integers. (2) Subtract the second column of the DataFrame from all the columns in DataFrame.</p>

In [ ]:
# Write your code over here

### 2.4. Combining Datasets

<p><b>Note:</b> <b style="color:blue;">concat( )</b> method can be used in Pandas to concatenate datasets.</p>

In [79]:
# Example
df1 = pd.DataFrame([['A00', 'A01'],['A10','A11']], 
                   columns = ['A0','A1'], 
                   index = [0,1]) 
df1

    A0   A1
0  A00  A01
1  A10  A11

In [80]:
df2 = pd.DataFrame([['A20', 'A21'],['A30','A31']], 
                   columns = ['A0','A1'], 
                   index = [0,1]) 
df2

    A0   A1
0  A20  A21
1  A30  A31

In [81]:
pd.concat([df1,df2],axis =0)

    A0   A1
0  A00  A01
1  A10  A11
0  A20  A21
1  A30  A31

In [82]:
# having rows with similar index is not appropriate
# you can ignore existing indicies and generate new ones
# you can also use multi-index format which is not topic of this session
pd.concat([df1,df2],axis =0, ignore_index=True)

    A0   A1
0  A00  A01
1  A10  A11
2  A20  A21
3  A30  A31

In [83]:
# You can also concatenate datafarmes side by side
pd.concat([df1,df2],axis =1, ignore_index=True)

     0    1    2    3
0  A00  A01  A20  A21
1  A10  A11  A30  A31

### 2.4.1. Concatenation with join

<p>In practice data from difference sources can have different column names and you might be interested to do concatenation over the common columns. Pandas provide this option by allowing us to use inner join.</p>

In [84]:
# An example with outer joining - the default option
df3 = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]], columns = ['A','B','C'])
df4 = pd.DataFrame([[11,12,13],[14,15,16],[17,18,19]], columns = ['B','C','D'])

In [85]:
df3

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [86]:
df4

    B   C   D
0  11  12  13
1  14  15  16
2  17  18  19

In [87]:
pd.concat([df3,df4],axis =0, ignore_index=True)

     A   B   C     D
0  1.0   2   3   NaN
1  4.0   5   6   NaN
2  7.0   8   9   NaN
3  NaN  11  12  13.0
4  NaN  14  15  16.0
5  NaN  17  18  19.0

In [55]:
# An example with inner join
df3 = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]], columns = ['A','B','C'])
df4 = pd.DataFrame([[11,12,13],[14,15,16],[17,18,19]], columns = ['B','C','D'])
pd.concat([df3,df4],axis =0, ignore_index=True, join='inner')

    B   C
0   2   3
1   5   6
2   8   9
3  11  12
4  14  15
5  17  18

### 2.4.2. Merge and Join

<p>In many cases you need to join DataFrames based on values in columns. <b style="color:blue">merge( )</b> is a method that allows us to achieve this goal. </p>

In [3]:
# Here is a new set of data
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})

print(df1)

print(df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

<b>Note:</b> Pandas recognizes that both DataFrames have the "employee" column, so it uses that column as the key.

In [4]:
df3 = pd.merge(df1,df2)  
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

<p><b>Note:</b> You can also define the key explicitly. </p>

In [59]:
# here is an example of merge with explicit keys
df3 = pd.merge(df1,df2, on='employee')

In [60]:
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

<p><b>Note:</b> (Important) keep in mind that merging datasets can happen in three forms: (similar to sql) </p>

* one-to-one
* one-to-many
* many-to-many

<b>Example:</b>

In [61]:
# Let's see an example of one-to-many
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR','Data Science'],
                    'supervisor': ['Carly', 'Guido', 'Steve', 'John']})
df4

          group supervisor
0    Accounting      Carly
1   Engineering      Guido
2            HR      Steve
3  Data Science       John

In [62]:
# one-to-many merge 
df5 = pd.merge(df3, df4)
pd.merge(df3, df4)

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

<b>Note:</b> Pandas merge datasets in an <b style='color:blue'>inner</b> format. That means the output only involves those key values that exist in both dataframes. If you want to have all the rows, regardless of existance of the key in both dataframes then you need to use the  <b style='color:blue'>outer</b> format.

In [63]:
df5 = pd.merge(df3, df4)
pd.merge(df3, df4, how='outer')

  employee         group  hire_date supervisor
0      Bob    Accounting     2008.0      Carly
1     Jake   Engineering     2012.0      Guido
2     Lisa   Engineering     2004.0      Guido
3      Sue            HR     2014.0      Steve
4      NaN  Data Science        NaN       John

<b>Example:</b> Let's see an example of many-to-many

In [64]:
df6 = pd.DataFrame({'group': ['Accounting', 'Accounting','Engineering', 
                              'Engineering', 'HR', 'HR'],
                    'skills': ['math', 'spreadsheets', 'coding', 
                               'linux','spreadsheets', 'organization']})
df6

         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

In [65]:
df7 = pd.merge(df5, df6) # this time merges on group
df7

  employee        group  hire_date supervisor        skills
0      Bob   Accounting       2008      Carly          math
1      Bob   Accounting       2008      Carly  spreadsheets
2     Jake  Engineering       2012      Guido        coding
3     Jake  Engineering       2012      Guido         linux
4     Lisa  Engineering       2004      Guido        coding
5     Lisa  Engineering       2004      Guido         linux
6      Sue           HR       2014      Steve  spreadsheets
7      Sue           HR       2014      Steve  organization

<p><b>Note:</b> There could be circumstances that you may wish to merge two datasets with different column names. In such cases you can use <b style='color:red;'>left_on</b> and <b style='color:red;'>right_on</b> keywords.</p>

In [5]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df8 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'salary': [70000, 80000, 120000, 90000]})

df9 = pd.merge(df1, df8, left_on="employee", right_on="name")

In [6]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [7]:
df8

   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

In [8]:
df9

  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

In [9]:
df9.drop(['name','group'],axis = 1, inplace=True)

<p><b>Note:</b> you can use <b style='color:blue;'>drop( )</b> method to drop a column from a DataFrame.</p>

In [71]:
# Let's drop the redundant column in last merge
pd.merge(df1, df8, left_on="employee", right_on="name").drop('name',axis = 1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

In [10]:
dataset = pd.merge(df1, df8, left_on="employee", right_on="name")
dataset.drop(['name','group'], axis=1, inplace =True)

In [11]:
dataset

  employee  salary
0      Bob   70000
1     Jake   80000
2     Lisa  120000
3      Sue   90000

<p><b>Advanced Note:</b> you can use indices to merge DataFrames. In ordet to do that you need to add <b style='color:blue;'>left_index=</b><b style='color:red;'>True</b> and <b style='color:blue;'>right_index=</b><b style='color:red;'>True</b> keywords to your method.</p>

### 2.5. Read Datasets from CSV

<p> To continue you need to download the movielens dataset</p>
<ul>
    <li>Click on the following link: <a href="https://grouplens.org/datasets/movielens/latest/">https://grouplens.org/datasets/movielens/latest/</a></li>
    <li>Download the ml-latest-small.zip file</li>
    <li>In the same folder that you saved your IPython (Jupyter) file, create a new folder and rename it to movielens</li>
    <li>Unzip the dataset into movielens folder</li>
    <li>There should be four CSV files in your folder (movies.csv, tags.csv, ratings.csv, links.csv)</li>
</ul>
Let's explore the dataset.
     </p>

<p><b>Note:</b> You can use pandas' <b style="color:blue;">read_csv( )</b> method to read a csv file.</p>

In [12]:
# Read movies.csv
movies = pd.read_csv('../../movielens/movies.csv', sep=',')
# Show the shape of the data
print(movies.shape)
print()
# Show type of the dataset
print(type(movies))

(9742, 3)

<class 'pandas.core.frame.DataFrame'>

<p><b>Note:</b> You can use <b style="color:blue;">head(n)</b> method to check top <i>n</i> rows of a DataFrame. You can also use <b style="color:blue;">tail(n)</b> method to check bottom <i>n</i> rows of a DataFrame. By default <i>n</i> is equal to 5.</p>

In [14]:
movies.head(10)

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy
5,6,Heat (1995),Action|Crime|Thriller
6,7,Sabrina (1995),Comedy|Romance
7,8,Tom and Huck (1995),Adventure|Children
8,9,Sudden Death (1995),Action
9,10,GoldenEye (1995),Action|Adventure|Thriller

In [15]:
movies.tail(10)

,movieId,title,genres
9732,193565,Gintama: The Movie (2010),Action|Animation|Comedy|Sci-Fi
9733,193567,anohana: The Flower We Saw That Day - The Movi...,Animation|Drama
9734,193571,Silver Spoon (2014),Comedy|Drama
9735,193573,Love Live! The School Idol Movie (2015),Animation
9736,193579,Jon Stewart Has Left the Building (2015),Documentary
9737,193581,Black Butler: Book of the Atlantic (2017),Action|Animation|Comedy|Fantasy
9738,193583,No Game No Life: Zero (2017),Animation|Comedy|Fantasy
9739,193585,Flint (2017),Drama
9740,193587,Bungo Stray Dogs: Dead Apple (2018),Action|Animation
9741,193609,Andrew Dice Clay: Dice Rules (1991),Comedy

In [81]:
movies.columns

Index(['movieId', 'title', 'genres'], dtype='object')

In [82]:
movies.index

RangeIndex(start=0, stop=9742, step=1)

<p><b>Example:</b> Read tags.csv file and explore the data.</p>

In [16]:
# Write your code over here
tags = pd.read_csv('../../movielens/tags.csv')

In [17]:
tags.head()

   userId  movieId              tag   timestamp
0       2    60756            funny  1445714994
1       2    60756  Highly quotable  1445714996
2       2    60756     will ferrell  1445714992
3       2    89774     Boxing story  1445715207
4       2    89774              MMA  1445715200

<p><b>Example:</b> Extract rows 10, 100, 500 from the tags dataset.</p>

In [19]:
# Write your code over here
tags.loc[[9,99,499],:]

     userId  movieId           tag   timestamp
9         7    48516  way too long  1169687325
99       62     6541  Sean Connery  1525554026
499     184     2579      mindfuck  1537094375

In [20]:
tags_sample = tags.loc[tags.userId>100].copy()

In [21]:
tags_sample

      userId  movieId               tag   timestamp
407      103      260              EPIC  1431954312
408      103      260  great soundtrack  1431954337
409      103      296     good dialogue  1431954555
410      103      296  great soundtrack  1431954555
411      103      296        non-linear  1431954555
...      ...      ...               ...         ...
3678     606     7382         for katie  1171234019
3679     606     7936           austere  1173392334
3680     610     3265            gun fu  1493843984
3681     610     3265  heroic bloodshed  1493843978
3682     610   168248  Heroic Bloodshed  1493844270

[3276 rows x 4 columns]

In [23]:
tags_sample.iloc[[9,99,499],:]

     userId  movieId        tag   timestamp
416     112      260       EPIC  1442535666
506     184     3793  superhero  1537094354
906     424    53127   Insanity  1457923284

In [96]:
tags_sample = tags_sample.reset_index(drop=True)

      userId  movieId               tag   timestamp
0        103      260              EPIC  1431954312
1        103      260  great soundtrack  1431954337
2        103      296     good dialogue  1431954555
3        103      296  great soundtrack  1431954555
4        103      296        non-linear  1431954555
...      ...      ...               ...         ...
3271     606     7382         for katie  1171234019
3272     606     7936           austere  1173392334
3273     610     3265            gun fu  1493843984
3274     610     3265  heroic bloodshed  1493843978
3275     610   168248  Heroic Bloodshed  1493844270

[3276 rows x 4 columns]

<p>Let's read ratings.csv file and collect more information about it.</p>

In [25]:
ratings = pd.read_csv('../../movielens/ratings.csv', sep=',')
ratings.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [26]:
# collect general statistical information
ratings.rating.describe()    # or ratings['rating'].describe()

count    100836.000000
mean          3.501557
std           1.042529
min           0.500000
25%           3.000000
50%           3.500000
75%           4.000000
max           5.000000
Name: rating, dtype: float64

In [27]:
# Keep in mind that you can get this information about whole dataset
# However some of them (such as information on movieid) may not be meaningful
ratings.describe()

              userId        movieId         rating     timestamp
count  100836.000000  100836.000000  100836.000000  1.008360e+05
mean      326.127564   19435.295718       3.501557  1.205946e+09
std       182.618491   35530.987199       1.042529  2.162610e+08
min         1.000000       1.000000       0.500000  8.281246e+08
25%       177.000000    1199.000000       3.000000  1.019124e+09
50%       325.000000    2991.000000       3.500000  1.186087e+09
75%       477.000000    8122.000000       4.000000  1.435994e+09
max       610.000000  193609.000000       5.000000  1.537799e+09

<p><b>Note:</b> Here is a list of useful methods:
    <ul>
        <li><b style="color:blue;">mean( )</b></li> 
        <li><b style="color:blue;">min( )</b></li>
        <li><b style="color:blue;">max( )</b></li>
        <li><b style="color:blue;">std( )</b></li>
        <li><b style="color:blue;">mode( )</b></li>
        <li><b style="color:blue;">corr( )</b></li>
        <li><b style="color:blue;">value_counts( )</b></li>
    </ul>
</p>

In [28]:
ratings.corr()

             userId   movieId    rating  timestamp
userId     1.000000  0.006773 -0.049348   0.097151
movieId    0.006773  1.000000 -0.004061   0.503669
rating    -0.049348 -0.004061  1.000000  -0.005802
timestamp  0.097151  0.503669 -0.005802   1.000000

In [104]:
# check methods over here
ratings.rating.value_counts( )

4.0    26818
3.0    20047
5.0    13211
3.5    13136
4.5     8551
2.0     7551
2.5     5550
1.0     2811
1.5     1791
0.5     1370
Name: rating, dtype: int64

<p><b>Example:</b> Filter the movie dataset to Comedy movies.</p>

In [29]:
movies

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy
...,...,...,...
9737,193581,Black Butler: Book of the Atlantic (2017),Action|Animation|Comedy|Fantasy
9738,193583,No Game No Life: Zero (2017),Animation|Comedy|Fantasy
9739,193585,Flint (2017),Drama
9740,193587,Bungo Stray Dogs: Dead Apple (2018),Action|Animation
9741,193609,Andrew Dice Clay: Dice Rules (1991),Comedy

In [30]:
flag = movies['genres'].str.contains("Comedy")
filtered_movie = movies.loc[flag,:]
filtered_movie.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy
6,7,Sabrina (1995),Comedy|Romance

In [31]:
flag

0        True
1       False
2        True
3        True
4        True
        ...
9737     True
9738     True
9739    False
9740    False
9741     True
Name: genres, Length: 9742, dtype: bool

<p><b>Example:</b> Filter the movie dataset to Animation movies that are released in 2017.</p>

In [32]:
# Write your code over here
filter_1 = movies['genres'].str.contains("Animation")
filter_2 = movies['title'].str.contains("2017")
filter_3 = movies['title'].str.contains("2018")
year_filter = filter_2 | filter_3
overall_filter = filter_1 & year_filter
movies.loc[overall_filter,:]

,movieId,title,genres
9452,167746,The Lego Batman Movie (2017),Action|Animation|Comedy
9460,168218,Kizumonogatari III: Cold Blood (2017),Animation|Fantasy|Mystery
9470,168418,The Boss Baby (2017),Animation|Children|Comedy
9507,170939,Captain Underpants: The First Epic Movie (2017),Action|Animation|Children|Comedy
9509,170957,Cars 3 (2017),Adventure|Animation|Comedy
9535,172547,Despicable Me 3 (2017),Adventure|Animation|Children|Comedy
9590,175475,The Emoji Movie (2017),Animation|Children|Comedy
9601,176051,LEGO DC Super Hero Girls: Brain Drain (2017),Animation
9605,176389,The Nut Job 2: Nutty by Nature (2017),Adventure|Animation|Children|Comedy
9617,177285,Sword Art Online The Movie: Ordinal Scale (2017),Action|Adventure|Animation|Fantasy|Sci-Fi
9621,177765,Coco (2017),Adventure|Animation|Children
9622,177939,"The Night Is Short, Walk on Girl (2017)",Animation|Romance
9624,178111,"Fireworks, Should We See It from the Side or t...",Animation
9629,178827,Paddington 2 (2017),Adventure|Animation|Children|Comedy
9633,179133,Loving Vincent (2017),Animation|Crime|Drama
9657,180987,Ferdinand (2017),Animation|Children|Comedy
9737,193581,Black Butler: Book of the Atlantic (2017),Action|Animation|Comedy|Fantasy
9738,193583,No Game No Life: Zero (2017),Animation|Comedy|Fantasy

<p><b>Example:</b> (1) Filter the ratings dataset to those rows that have rating of equal to 4.0 or more. (2) Count the number of rows. </p>

In [35]:
# Write your code over here
ratings.loc[ratings.rating>=4,:].shape[0]

48580

<p><b>Example:</b> (1) Merge movies and tags DataFrames (2) keep title and tag columns and drop the remaining columns.</p>

In [36]:
# Write your code over here
merged_data = pd.merge(movies,tags)
merged_data.loc[:,['title','tag']]

                               title               tag
0                   Toy Story (1995)             pixar
1                   Toy Story (1995)             pixar
2                   Toy Story (1995)               fun
3                     Jumanji (1995)           fantasy
4                     Jumanji (1995)  magic board game
...                              ...               ...
3678  Solo: A Star Wars Story (2018)         star wars
3679       Gintama: The Movie (2010)             anime
3680       Gintama: The Movie (2010)            comedy
3681       Gintama: The Movie (2010)           gintama
3682       Gintama: The Movie (2010)          remaster

[3683 rows x 2 columns]

### 2.6. Group By and Aggregation

<p> Group By command comes form the similar command line in SQL.</p>
<img src="https://www.dropbox.com/s/bjnqz2jjnzz7y53/Groupby.png?raw=1" width=600 height=600>
<p><b>Source</b>: VanderPlas, J., 2016. Python data science handbook: essential tools for working with data. " O'Reilly Media, Inc."</p>

In [49]:
df = pd.DataFrame([['A', 'F', 10, 15],
                   ['A', 'M', 11, 18],
                   ['B', 'F', 15, 22],
                   ['B', 'F', 17, 33],
                   ['A', 'M', 14, 22],
                   ['B', 'M', 17, 28]],
                  columns=['C1', 'C2', 'C3','C4'])
df

  C1 C2  C3  C4
0  A  F  10  15
1  A  M  11  18
2  B  F  15  22
3  B  F  17  33
4  A  M  14  22
5  B  M  17  28

In [38]:
# Let's find the average of columns when you group by C1
df.groupby('C1').mean()

           C3         C4
C1
A   11.666667  18.333333
B   16.333333  27.666667

<p><b>Note:</b> When you apply different operations using groupby function, it is better to change the column names in a way that represent values of each column.</p>

In [40]:
df.groupby('C1').mean().reset_index().rename(columns={'C3':'avg_C3', 'C4':'avg_C4'})

  C1     avg_C3     avg_C4
0  A  11.666667  18.333333
1  B  16.333333  27.666667

<p><b>Example:</b> Find the standard deviation of columns when you group by C1.</p>

In [ ]:
# write your code over here

<p><b>Example:</b> Find the average of column C3 when you group by C2.</p>

In [50]:
# write your code over here
df[['C2','C3']].groupby('C2').mean().reset_index()

  C2    C3
0  F  14.0
1  M  14.0

In [51]:
df.groupby('C2')[['C3']].mean().reset_index()

  C2    C3
0  F  14.0
1  M  14.0

<p><b>Note:</b> It is common to use count( ) in SQL to find the number of items in each group. However, it is recommended to use <b style='color:blue;'>size( )</b> to compute this value in Pandas.</p>

In [55]:
# Let's find the number of items from each group in column C1.
df.groupby('C1').size()

C1
A    3
B    3
dtype: int64

<p><b>Example:</b> If you want to get the result in a DataFrame format, you can use <b style='color:blue;'>reset_index( )</b> function.</p>

In [53]:
df.groupby('C1').size().reset_index(name='count_size')

  C1  count_size
0  A           3
1  B           3

<p><b>Note:</b> You can apply groupby( ) function using multiple columns.</p>

In [123]:
df.groupby(['C1','C2']).mean() # the result is in multiindex format (was not covered in this course)

         C3    C4
C1 C2
A  F   10.0  15.0
   M   12.5  20.0
B  F   16.0  27.5
   M   17.0  28.0

In [124]:
# if you don't want to use multi-index format you can use reset_index( ) function
df.groupby(['C1','C2']).mean().reset_index()

  C1 C2    C3    C4
0  A  F  10.0  15.0
1  A  M  12.5  20.0
2  B  F  16.0  27.5
3  B  M  17.0  28.0

<p><b>Example:</b> (1) Find the standard deviation of C3 and C4 when you group by both C1 and C2 (2) Rename the columns with representative names.

In [56]:
# write your code here
df.groupby(['C1','C2']).std()

             C3        C4
C1 C2
A  F        NaN       NaN
   M   2.121320  2.828427
B  F   1.414214  7.778175
   M        NaN       NaN

<p><b>Example:</b> Use ratings dataset and find the number of posted rating for each movie</p>

In [57]:
ratings

        userId  movieId  rating   timestamp
0            1        1     4.0   964982703
1            1        3     4.0   964981247
2            1        6     4.0   964982224
3            1       47     5.0   964983815
4            1       50     5.0   964982931
...        ...      ...     ...         ...
100831     610   166534     4.0  1493848402
100832     610   168248     5.0  1493850091
100833     610   168250     5.0  1494273047
100834     610   168252     5.0  1493846352
100835     610   170875     3.0  1493846415

[100836 rows x 4 columns]

In [59]:
# write your code here
ratings = pd.read_csv('../../movielens/ratings.csv')
ratings.groupby('movieId').size().reset_index(name='count_value')

      movieId  count_value
0           1          215
1           2          110
2           3           52
3           4            7
4           5           49
...       ...          ...
9719   193581            1
9720   193583            1
9721   193585            1
9722   193587            1
9723   193609            1

[9724 rows x 2 columns]

<p><b>Example:</b> Use ratings dataset and find the number of posted ratings by each user.</p>

In [60]:
# write your code over here 
ratings = pd.read_csv('../../movielens/ratings.csv')
ratings.groupby('userId').size().reset_index(name='count_value')

     userId  count_value
0         1          232
1         2           29
2         3           39
3         4          216
4         5           44
..      ...          ...
605     606         1115
606     607          187
607     608          831
608     609           37
609     610         1302

[610 rows x 2 columns]

<p><b>Example:</b> Use ratings dataset and find the average rating for each movie</p>

In [61]:
ratings[['movieId','rating']].groupby('movieId').mean().reset_index()

      movieId    rating
0           1  3.920930
1           2  3.431818
2           3  3.259615
3           4  2.357143
4           5  3.071429
...       ...       ...
9719   193581  4.000000
9720   193583  3.500000
9721   193585  3.500000
9722   193587  3.500000
9723   193609  4.000000

[9724 rows x 2 columns]

In [133]:
ratings_avg = ratings[['movieId','rating']].groupby('movieId').mean()
ratings_avg = ratings_avg.rename(columns={'rating':'rating_mean'})
ratings_avg.head()

         rating_mean
movieId
1           3.920930
2           3.431818
3           3.259615
4           2.357143
5           3.071429

<p><b>Example:</b> Use ratings dataset and find the average ratings posted by each user.</p>

In [ ]:
# write your code over here

<p><b>Example:</b> Use ratings, and movies datasets. Find titles of Drama movies that have average ratings of 3.5 or more.</p>

In [ ]:
# write your code over here

<p><b>Advanced Topic:</b> The <b style="color:blue;">apply( )</b> method lets you apply an arbitrary function to the group results.</p>

### 2.7. Sort Dataset Values

<P><b>Note:</b> <b style='color:blue;'>sort_values( )</b> is a poweful function in pandas that allows you to reorder your DataFrame based on values of one or multiple columns.</P>

In [62]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue', 'Eric', 'John'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR','Data Science', 'Data Science'],
                    'age' : [25, 23, 32, 41, 33, 36],
                    'salary' : [90000, 75000, 83000, 65000, 140000, 110000]})
df1

  employee         group  age  salary
0      Bob    Accounting   25   90000
1     Jake   Engineering   23   75000
2     Lisa   Engineering   32   83000
3      Sue            HR   41   65000
4     Eric  Data Science   33  140000
5     John  Data Science   36  110000

In [63]:
# Sort by age
df1.sort_values(by='age')

  employee         group  age  salary
1     Jake   Engineering   23   75000
0      Bob    Accounting   25   90000
2     Lisa   Engineering   32   83000
4     Eric  Data Science   33  140000
5     John  Data Science   36  110000
3      Sue            HR   41   65000

In [64]:
# Sort by age in a descending format
df1.sort_values(by=['age'], ascending=False)

  employee         group  age  salary
3      Sue            HR   41   65000
5     John  Data Science   36  110000
4     Eric  Data Science   33  140000
2     Lisa   Engineering   32   83000
0      Bob    Accounting   25   90000
1     Jake   Engineering   23   75000

In [66]:
# Sort by group and salary
df1.sort_values(by=['group', 'salary'], ascending = [True,False])

  employee         group  age  salary
0      Bob    Accounting   25   90000
4     Eric  Data Science   33  140000
5     John  Data Science   36  110000
2     Lisa   Engineering   32   83000
1     Jake   Engineering   23   75000
3      Sue            HR   41   65000

### 2.8. Working with Big Data

<p>If the dataset you want to load is too big to fit in the memory, you can deal with it by using a batch machine learning algorithm, which works with only a part of the data at once. This operation is also called data streaming since the dataset flows into a DataFrame or some other data structure as a continuous flow. As opposed to all the previous cases, the dataset has been fully loaded into the memory in a standalone step. </p>

In [ ]:
# imagine that movies dataset is a huge dataset that does not fit in your memmory
movies_chunks = pd.read_csv('../movielens/movies.csv', chunksize=10) 
for chunk in movies_chunks: 
    print ('Shape:', chunk.shape) 
    print (chunk,'n')

<p><b>Note:</b> The output of the read_csv function, in this case, is not a pandas DataFrame, but an iterator-like object. In fact, to get the results in memory, you need to iterate that object</p>